<script setup></script>

<template>
    <h1>Создание пользователей для организации</h1>
    <a-typography-text>
        Важно учесть, что если у организации есть AD домен, то
        <b>сначала мы запрашиваем пользователей из AD домена</b>
        , а уже потом в таблицу AD пользователи добавляем необходимую информацию к записи
        пользователя.
        <br />
        Если у организации
        <b>нет AD домена</b>
        и мы создаем пользователей для данной организации, а потом захотим связать пользователями из
        AD домена, то придется либо это сделать вручную в базе данных либо удалить текущих
        пользователей и добавить ту же информацию к свежесозданным пользователям, которые были
        получены из AD домена.
    </a-typography-text>
</template>

<style lang="scss" scoped></style>
